{"version":"https://jsonfeed.org/version/1.1","title":"Poems","home_page_url":"https://salastro.github.io/poems/?utm_source=json_feed","description":"Poems by SalahDin A. Rezk","icon":"https://salastro.github.io/poems/poems_hu_87a03a0a7efc19f.png","favicon":"https://salastro.github.io/poems/poems_hu_87a03a0a7efc19f.png","authors":[{"name":"SalahDin A. Rezk"}],"language":"en","items":[{"id":"38c8ae03-f6ac-5e5e-a9bd-bb2919242c51","url":"https://salastro.github.io/poems/void-whispers/?utm_source=json_feed","title":"Void Whispers","summary":" The void whispers screams in the silence, Only for me to feel, to drown in its call, I reach for the light beyond the abyss, Yet my hands fall short, never reaching far. ","date_published":"2025-05-28T00:00:00Z"},{"id":"24e73634-0767-57a5-49d8-839d57c83d94","url":"https://salastro.github.io/poems/fleeting-away/?utm_source=json_feed","title":"Fleeting Away","summary":" Life fleeting away, days count bad, Like sand passing through my hand. I cannot catch even a single grain, Let alone catch up to life and not feel pain. The sun still shines, but not for me, too far, A dying light I see, behind a prison bar. Each breath I take feels borrowed, not mine, A ticking clock with no clear sign. Dreams fade like ghosts down a hollow hall, Each hope I held now condemned to fall. Smiles are masks I barely wear, Joy, my friend, it was never there. ","date_published":"2025-05-03T00:00:00Z"},{"id":"a94e8071-c2b6-5560-29e3-27414dec18f3","url":"https://salastro.github.io/poems/cannot-blame/?utm_source=json_feed","title":"Cannot Blame","summary":" During night and day, I can\u0026rsquo;t forget your name, Through roads, long and wide, memories haunt me. I play songs, recite words, maybe then my soul will be freed, Despite that, it is still chained by what\u0026rsquo;s been forged before. Through future and past, regret now speaks my name, Each step I take, a weight I cannot blame. No wish remains to kindle former flame, Just burdens wrought by words once left. No matter what I do and do, I still lose you. Didn\u0026rsquo;t I give you the sky\u0026rsquo;s stars and my heart? Yet now each step I take is without you. They lead me further and further, worlds apart. ","date_published":"2025-02-07T00:00:00Z"},{"id":"7bbe4220-57b1-5f6f-a9eb-95a4781e7c6e","url":"https://salastro.github.io/poems/finite-sum/?utm_source=json_feed","title":"Finite Sum","summary":" The number of hours we have, is a finite sum. Each second subtracts a little more, yet I want to steal infinity, from a universe that won’t allow it. Please, linger near the door, hesitating on the edge. Fill the air with unsaid words, to keep me tethered here. Please, don\u0026rsquo;t just leave. Leave something— a trace, a breath, a memory that I can hold in this fragile reality of ours. ","date_published":"2025-01-08T00:00:00Z"},{"id":"00983669-4aca-56e4-3998-603d9fc5a287","url":"https://salastro.github.io/poems/remember-the-blue-nights/?utm_source=json_feed","title":"Remember the Blue Nights","summary":" Even the reddest of roses, wilts During winter\u0026rsquo;s cold nights, it dies. In the middle of the breeze, my hands freeze, With nothing for me to hold onto. ","date_published":"2024-12-28T00:00:00Z"},{"id":"d729d312-63ff-54d5-2975-b43bed6540f5","url":"https://salastro.github.io/poems/to-do-my-best/?utm_source=json_feed","title":"To Do My Best","summary":" I\u0026rsquo;ve tried to grow, to do my best, Yet still, I fall and fail the test. For what’s a life, no matter how free, If I’m unseen by the one who I see? ","date_published":"2024-12-13T00:00:00Z"},{"id":"89b1dfe2-b3c4-5c85-b94b-6ea71a9a224c","url":"https://salastro.github.io/poems/abyss-of-despair/?utm_source=json_feed","title":"Abyss of Despair","summary":" Rest has not been bestowed upon my soul. I suffer in silence and crumble inward. Meaning useless in the face of the absurd. Thousand fights and still a lot to build. Not only my heart aches, but also my body, Broken into pieces, shedding tears bloody. I long for peace and serenity, love and tranquility, Through shattered dreams and endless nights. No cause will salvage myself, As engraved on this soul\u0026rsquo;s shelf, Wounds run deep beyond belief. Screaming in the abyss of despair. ","date_published":"2024-11-15T00:00:00Z"},{"id":"5fbc1725-58de-5079-d9a1-479793134685","url":"https://salastro.github.io/poems/long-walks/?utm_source=json_feed","title":"Long Walks","summary":" Tired from long walks No rest in between No results to be seen Horns in roses pricks I fall in despair With no avail No hope for repair In a world so pale ","date_published":"2024-08-31T00:00:00Z"},{"id":"818e862b-4ba6-5624-c90d-758498b579fc","url":"https://salastro.github.io/poems/anxiety/?utm_source=json_feed","title":"Anxiety","summary":" Anxiety crawling up my sleeve Stress causing me bleed Doubt eating me alive Peace is hard to find ","date_published":"2024-08-05T00:00:00Z"},{"id":"28b2f800-4fa9-5265-0918-ea3dddcd8b4e","url":"https://salastro.github.io/poems/magenta/?utm_source=json_feed","title":"Magenta","summary":" Long road, Eternal pain, Blood spread. Tears shed. ","date_published":"2024-06-16T00:00:00Z"},{"id":"1cd70ed0-6c8b-5a55-695e-4d0bb8297dac","url":"https://salastro.github.io/poems/tired/?utm_source=json_feed","title":"Tired","summary":" Brain tired, bones broken, Flesh burned, spirit shaken, Eyes heavy, heart laden, Yet the journey must be taken. ","date_published":"2024-05-19T00:00:00Z"},{"id":"add0694e-7d5c-5dfa-8962-e73cc71ef628","url":"https://salastro.github.io/poems/chess/?utm_source=json_feed","title":"Chess","summary":" Pawns fallen, failure taken, Mistakes played out, unforeseen, Endgame near, strategy broken. ","date_published":"2024-05-19T00:00:00Z"},{"id":"8f864b9f-5fcd-5e79-d952-5d55b21985e7","url":"https://salastro.github.io/poems/sharp-swords/?utm_source=json_feed","title":"Sharp Swords","summary":" Sharp swords piercing through heart weak, Dark nights long, each wound a shriek. Many battles lost, hidden and seen, One finds silence between the screams. Through the chaos, I find no meaning, A thousand strokes, yet no word, Only silence echoes in the void, Lost in an ocean of thoughts, Searching for a thread of truth, But the maze seems endless. ","date_published":"2024-04-18T00:00:00Z"},{"id":"6be82d54-504d-5563-d9db-ab41d3381534","url":"https://salastro.github.io/poems/sleep-scarce/?utm_source=json_feed","title":"Sleep Scarce","summary":" Sleep scarce with mind shattered Pain prevails in nights\u0026rsquo; darkeness Whispers of dreams, elusive they seem Tangled thoughts, and silent screams ","date_published":"2024-04-17T00:00:00Z"},{"id":"7af4536d-1c89-5801-1994-156446eaa836","url":"https://salastro.github.io/poems/arrows-of-fire/?utm_source=json_feed","title":"Arrows of Fire","summary":" Arrows of fire burning flame, Piercing through my heart, I feel it in my soul, I suffocate drowning in my own tears, I can feel the individual tissues of my heart breaking, My soul bring taken Death looms Maybe one, I could lay and never wake up ","date_published":"2024-04-08T00:00:00Z"},{"id":"890111df-50ff-59ca-19aa-bf4fb89f4597","url":"https://salastro.github.io/poems/nightmares-creep/?utm_source=json_feed","title":"Nightmares Creep","summary":" Through the dark, where nightmares creep, I stir from slumber, promises unkeep. Unbroken bones, unworn skin, Vast universe, where to begin? ","date_published":"2024-03-17T00:00:00Z"},{"id":"798a923a-f0c8-53e1-d944-bc7fce3dc13a","url":"https://salastro.github.io/poems/unforgiven/?utm_source=json_feed","title":"Unforgiven","summary":" O mighty God, burn my soul alive, For I have sinned, beyond all belief. O mighty God, where can I find thee? In midst of the dark, I fall into insanity. Thine slave can neither hear nor see! Shall not purpose be given out of pity? Forgiveness sook to no avail; doom is met! Shadows so deep, despair does dwell. ","date_published":"2024-02-29T00:00:00Z"},{"id":"d83b52b5-e6be-510b-39d0-5f8c7f6c5eed","url":"https://salastro.github.io/poems/stars-bright/?utm_source=json_feed","title":"Stars Bright","summary":" I wish to reach stars bright, To glimpse their glow as they ignite. So bright they shine in the night, I wish for a piece of their eternal light. I can feel the skies calling for me, A higher call, towards my fate, Yet I shall be fit for such treasure, To endure the trials, hard and great. ","date_published":"2024-02-18T00:00:00Z"},{"id":"6e8606a5-4bce-5d4a-a93e-ba00e92acf80","url":"https://salastro.github.io/poems/for-me-to-rise/?utm_source=json_feed","title":"For Me to Rise","summary":" Eradicate my ideas, Destroy my ideals, Burn me alive, For me to rise. ","date_published":"2024-01-28T00:00:00Z"},{"id":"3d74b976-93a5-517f-09af-fa8e56caaef1","url":"https://salastro.github.io/poems/unsolved/?utm_source=json_feed","title":"Unsolved","summary":" While sleep is despair, Equations run incomplete: Geometry of unsolved square, Program with memory that leak. I find my mind bleak, As I write on the big canvas, As I walk through the street, As I think of the rhyme\u0026rsquo;s chorus. Through the city\u0026rsquo;s veins, I wander and stare, Searching for solace, In the midnight air. Running in loops, A relentless nightmare. Like an old rocking chair, Moments cascade. ","date_published":"2023-12-27T00:00:00Z"},{"id":"610124db-1ff3-5539-7960-61d4eadcd6d9","url":"https://salastro.github.io/poems/i-ask/?utm_source=json_feed","title":"I Ask","summary":" I ask the God, so high above, For something more than me, O God, so mighty, so pure Can I behold more than I can see? ","date_published":"2023-09-29T00:00:00Z"},{"id":"2a6375ab-5a51-5a7d-d98e-056866547f6e","url":"https://salastro.github.io/poems/stillness-of-the-night/?utm_source=json_feed","title":"Stillness of the Night","summary":" In the stillness of the night, My insomnia grips me tight. My soul is tired, cannot rest, And I am left alone, distressed. The moon above shines bright and clear, A light in the dark, so near. But still my mind is plagued with thought, And sleep is something I have fought. The stars above dance in the sky, A million dreams that pass me by. But I am lost in my own world, Where sleep is scarce and thoughts unfurled. I long to find some peace of mind, And leave my worries far behind. But for now, I\u0026rsquo;ll watch the moon, And hope my dreams will come soon. ","date_published":"2023-08-25T00:00:00Z"},{"id":"759ab3db-ad73-5ec0-7961-2adeff41280d","url":"https://salastro.github.io/poems/homesick/?utm_source=json_feed","title":"Homesick","summary":" Endless longing for a distant home, Crawling helplessly with no hope to come, Incapable, unable to bridge the divide, No end in sight, no chance to arrive. ","date_published":"2023-07-31T00:00:00Z"},{"id":"12e53ea3-485f-5f76-1994-cfda7d9c51e9","url":"https://salastro.github.io/poems/wings/?utm_source=json_feed","title":"Wings","summary":" Did you see my wings, Darker than the night? The symbol of my strength, A vision of my might. But my wings are fragile, Handle them with care, For with one wrong move, I\u0026rsquo;ll come crashing down in despair. ","date_published":"2023-07-13T00:00:00Z"}]}